; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 865601 2 1 4 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph2 - mode
	image0 - mode
	thermograph3 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star1 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite1 Phenomenon5)
	(have_image Phenomenon3 image0)
	(have_image Phenomenon4 infrared1)
	(have_image Phenomenon5 infrared1)
	(have_image Planet6 image0)
	(have_image Planet7 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
3. (turn_to satellite0 star1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star1)
   goals met: 2 of 7
4. (turn_to satellite1 star1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star1)
   goals met: 1 of 7
5. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 7
6. (turn_to satellite0 groundstation2 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 7
7. (turn_to satellite1 planet7 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet7)
   goals met: 0 of 7
8. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 7
9. (take_image satellite1 planet7 instrument1 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 1 of 7
10. (turn_to satellite0 star1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star1)
   goals met: 2 of 7
11. (turn_to satellite1 phenomenon4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon4)
   goals met: 2 of 7
12. (turn_to satellite0 planet6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet6)
   goals met: 1 of 7
13. (take_image satellite1 phenomenon4 instrument1 infrared1)
   added: (have_image phenomenon4 infrared1)
   goals met: 2 of 7
14. (take_image satellite0 planet6 instrument0 image0)
   added: (have_image planet6 image0)
   goals met: 3 of 7
15. (turn_to satellite1 phenomenon5 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon5)
   goals met: 4 of 7
16. (turn_to satellite0 star1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star1)
   goals met: 5 of 7
17. (take_image satellite1 phenomenon5 instrument1 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 6 of 7
18. (turn_to satellite0 phenomenon3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon3)
   goals met: 5 of 7
19. (take_image satellite0 phenomenon3 instrument0 image0)
   added: (have_image phenomenon3 image0)
   goals met: 6 of 7
20. (turn_to satellite0 star1 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 star1)
   goals met: 7 of 7
